src/СРМ/src/Catalogs/RA_RedmineЗадачи/RA_RedmineЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RA_RedmineЗадачи</name>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.RA_RedmineПроекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Трекер</name>
    <type>
      <types>CatalogRef.RA_RedmineТрекеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.RA_RedmineСтатусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>CatalogRef.RA_RedmineПриоритеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>CatalogRef.RA_RedmineКатегорииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаТрудозатрат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StoryPoints</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактОбращения</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Задача</name>
    <type>
      <types>DocumentRef.Задача</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/СРМ/src/Enums/RA_RedmineВидыИзмененийЗадач/RA_RedmineВидыИзмененийЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>RA_RedmineВидыИзмененийЗадач</name>
  <enumValues>
    <name>Комментарий</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСтатуса</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеРеквизита</name>
  </enumValues>
</mdclass:Enum>

src/СРМ/src/Catalogs/RA_RedmineИзмененияЗадач/RA_RedmineИзмененияЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>RA_RedmineИзмененияЗадач</name>
  <owners>Catalog.RA_RedmineЗадачи</owners>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.RA_RedmineПользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИзменения</name>
    <type>
      <types>EnumRef.RA_RedmineВидыИзмененийЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийЗадачи</name>
    <type>
      <types>CatalogRef.КомментарииЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтароеЗначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НовоеЗначение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/СРМ/src/Catalogs/RA_RedmineЗадачи/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;

	УстановитьПараметрыДинамическогоСпискаТрудозатрат();
	УстановитьПараметрыДинамическогоСпискаИсторииИзменений();
	
	ОбновитьКомментарии();
	
	ОбновитьВсегоТрудозатрат();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВсегоТрудозатрат()
	
	ВсегоТрудозатрат = RA_RedmineСервер.ВсегоТрудозатратПоЗадаче(Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСпискаТрудозатрат()
	
	Трудозатраты.Параметры.УстановитьЗначениеПараметра("Задача", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыДинамическогоСпискаИсторииИзменений()
	
	ИсторияИзменений.Параметры.УстановитьЗначениеПараметра("Владелец", Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомментарии()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	RA_RedmineИзмененияЗадач.ДатаСоздания КАК ДатаСоздания,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(RA_RedmineИзмененияЗадач.Пользователь) КАК Пользователь,
	|	RA_RedmineИзмененияЗадач.Комментарий КАК Комментарий
	|ИЗ
	|	Справочник.RA_RedmineИзмененияЗадач КАК RA_RedmineИзмененияЗадач
	|ГДЕ
	|	RA_RedmineИзмененияЗадач.Владелец = &Владелец
	|	И RA_RedmineИзмененияЗадач.ВидИзменения = &ВидИзменения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания";
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	Запрос.УстановитьПараметр("ВидИзменения", Перечисления.RA_RedmineВидыИзмененийЗадач.Комментарий);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивКомментариев = Новый Массив;
	ШаблонКомментария = "<P><EM>%1 %2:</EM></P><P>%3<HR /></P>";
	
	// первый комментарий - описание задачи
	СтрокаКомментария = СтрШаблон(ШаблонКомментария, Объект.ДатаСоздания, Объект.Автор, ?(ЗначениеЗаполнено(Объект.Описание), Объект.Описание, Объект.Наименование));
		
	МассивКомментариев.Добавить(СтрокаКомментария);
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаКомментария = СтрШаблон(ШаблонКомментария, Выборка.ДатаСоздания, Выборка.Пользователь, Выборка.Комментарий);
			
		МассивКомментариев.Добавить(СтрокаКомментария);
		
	КонецЦикла;
	
	Комментарии = "<HTML><HEAD><META content=""text/html; charset=utf-8""></HEAD><BODY>"
		+ СтрСоединить(МассивКомментариев,"") + "</BODY></HTML>";
	
КонецПроцедуры
